In [1]:
person = {
    'first': 'Corey',
    'last': 'Schafer',
    'email': 'CoreyMSchafer@gmail.com'
}

In [2]:
people = {
    'first': ['Corey'],
    'last': ['Schafer'],
    'email': ['CoreyMSchafer@gmail.com']
}

In [4]:
people = {
    'first': ['Corey', 'Jhon', 'Jane'],
    'last': ['Schafer', 'Doe', 'Dow'],
    'email': ['CoreyMSchafer@gmail.com', 'JhonDoe@example.com', 'JaneDow@example.com']
}

In [5]:
people['email']

['CoreyMSchafer@gmail.com', 'JhonDoe@example.com', 'JaneDow@example.com']

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame(people)

In [8]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jhon      Doe      JhonDoe@example.com
2   Jane      Dow      JaneDow@example.com

In [9]:
df['email']

0    CoreyMSchafer@gmail.com
1        JhonDoe@example.com
2        JaneDow@example.com
Name: email, dtype: object

In [10]:
type(df['email'])

pandas.core.series.Series

In [12]:
df[['last', 'email']]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe      JhonDoe@example.com
2      Dow      JaneDow@example.com

In [13]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [14]:
df.iloc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [16]:
df.iloc[0]['last']

'Schafer'

In [17]:
df.iloc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jhon      Doe      JhonDoe@example.com

In [18]:
df.iloc[[0, 1]]['last']

0    Schafer
1        Doe
Name: last, dtype: object

In [19]:
df.iloc[[0, 1]][['last', 'first']]

      last  first
0  Schafer  Corey
1      Doe   Jhon

In [20]:
df.iloc[[0, 1], 1]

0    Schafer
1        Doe
Name: last, dtype: object

In [21]:
df.iloc[[0, 1], [1, 2]]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe      JhonDoe@example.com

In [22]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jhon      Doe      JhonDoe@example.com
2   Jane      Dow      JaneDow@example.com

In [24]:
df.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [25]:
df.loc[[0, 1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jhon      Doe      JhonDoe@example.com

In [26]:
df.loc[[0, 1], 'email']

0    CoreyMSchafer@gmail.com
1        JhonDoe@example.com
Name: email, dtype: object

In [28]:
df.loc[[0, 1], ['email', 'last']]

                     email     last
0  CoreyMSchafer@gmail.com  Schafer
1      JhonDoe@example.com      Doe